# IsValidWarningIndex Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ConnectionValidationInfo..::..IsValidWarningIndex Method
ConnectionValidationInfo Class See Also
---
Validate warning index.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2016
# Syntax
C#
---
```text
public bool IsValidWarningIndex(
	int index
)
```

Visual Basic
---
```text
Public Function IsValidWarningIndex ( _
	index As Integer _
) As Boolean
```

Visual C++
---
```text
public:
bool IsValidWarningIndex(
	int index
)
```

# ### Parameters
index
    Type: System..::..Int32
# See Also
ConnectionValidationInfo Class
Autodesk.Revit.DB Namespace